/* compact crypto stuff
 *   via http://ru.wikipedia.org
 *   @ 1/28/2009 3:18 PM CST */
using System;
namespace бизнес_сфере{
  public class машина{
    public string возвращаемого_значения(string вход){
      int[] постоянная=new[]{7,12,17,22,7,12,17,22,7,12,17,22,7,12,17,22,5,9,14,20,5,9,14,20,5,9,14,20,5,9,14,20,4,11,16,23,4,11,16,23,4,11,16,23,4,11,16,23,6,10,15,21,6,10,15,21,6,10,15,21,6,10,15,21};
      int[] прочный=new int[64];
      for(int итератор=0;итератор<64;++итератор)
        прочный[итератор]=(int)Math.Floor(Math.Abs(Math.Sin(итератор+1))*Math.Pow(2,32));
      int первичный0=0x67452301;
      int первичный1=0xefcdab89;
      int первичный2=0x98badcfe;
      int первичный3=0x10325476;
      
    }
  }
}